{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "EditorPlusTools",
			"Children": [
				{
					"Source":
					{
						"Text": "ClassBrowser"
					},
					"Translation":
					{
						"Text": "类浏览器"
					},
					"Key": "ClassBrowser"
				},
				{
					"Source":
					{
						"Text": "Collections"
					},
					"Translation":
					{
						"Text": "收藏"
					},
					"Key": "MenuCollections"
				},
				{
					"Source":
					{
						"Text": "Command1"
					},
					"Translation":
					{
						"Text": "命令1"
					},
					"Key": "Command1"
				},
				{
					"Source":
					{
						"Text": "Command1Tips"
					},
					"Translation":
					{
						"Text": "命令1提示"
					},
					"Key": "Command1Tips"
				},
				{
					"Source":
					{
						"Text": "Command2"
					},
					"Translation":
					{
						"Text": "命令2"
					},
					"Key": "Command2"
				},
				{
					"Source":
					{
						"Text": "Command2Tips"
					},
					"Translation":
					{
						"Text": "命令2提示"
					},
					"Key": "Command2Tips"
				},
				{
					"Source":
					{
						"Text": "Command3"
					},
					"Translation":
					{
						"Text": "命令3"
					},
					"Key": "Command3"
				},
				{
					"Source":
					{
						"Text": "Command3Tips"
					},
					"Translation":
					{
						"Text": "命令3提示"
					},
					"Key": "Command3Tips"
				},
				{
					"Source":
					{
						"Text": "Command4"
					},
					"Translation":
					{
						"Text": "命令4"
					},
					"Key": "Command4"
				},
				{
					"Source":
					{
						"Text": "Command4Tips"
					},
					"Translation":
					{
						"Text": "命令4提示"
					},
					"Key": "Command4Tips"
				},
				{
					"Source":
					{
						"Text": "Command6"
					},
					"Translation":
					{
						"Text": "命令6"
					},
					"Key": "Command6"
				},
				{
					"Source":
					{
						"Text": "Command6Tips"
					},
					"Translation":
					{
						"Text": "命令6提示"
					},
					"Key": "Command6Tips"
				},
				{
					"Source":
					{
						"Text": "CustomSection1"
					},
					"Translation":
					{
						"Text": "自定义节1"
					},
					"Key": "CustomSection1"
				},
				{
					"Source":
					{
						"Text": "CustomWidget"
					},
					"Translation":
					{
						"Text": "自定义控件"
					},
					"Key": "CustomWidget"
				},
				{
					"Source":
					{
						"Text": "EditorPlusTools"
					},
					"Translation":
					{
						"Text": "工具+"
					},
					"Key": "EditorPlusTools"
				},
				{
					"Source":
					{
						"Text": "ExtendPath1"
					},
					"Translation":
					{
						"Text": "扩展命令1"
					},
					"Key": "ExtendPath1"
				},
				{
					"Source":
					{
						"Text": "ExtendPath1Tips"
					},
					"Translation":
					{
						"Text": "扩展命令1提示"
					},
					"Key": "ExtendPath1Tips"
				},
				{
					"Source":
					{
						"Text": "ExtendPath2"
					},
					"Translation":
					{
						"Text": "扩展命令2"
					},
					"Key": "ExtendPath2"
				},
				{
					"Source":
					{
						"Text": "ExtendPath2Tips"
					},
					"Translation":
					{
						"Text": "扩展命令2提示"
					},
					"Key": "ExtendPath2Tips"
				},
				{
					"Source":
					{
						"Text": "ExtendWidget"
					},
					"Translation":
					{
						"Text": "扩展控件"
					},
					"Key": "ExtendWidget"
				},
				{
					"Source":
					{
						"Text": "FMenuTestCommands"
					},
					"Translation":
					{
						"Text": "测试命令"
					},
					"Key": "FMenuTestCommands"
				},
				{
					"Source":
					{
						"Text": "Find"
					},
					"Translation":
					{
						"Text": "查找"
					},
					"Key": "MenuCollectionFind"
				},
				{
					"Source":
					{
						"Text": "MenuCollection"
					},
					"Translation":
					{
						"Text": "命令收藏"
					},
					"Key": "MenuCollection"
				},
				{
					"Source":
					{
						"Text": "MenuTest"
					},
					"Translation":
					{
						"Text": "测试菜单"
					},
					"Key": "MenuTest"
				},
				{
					"Source":
					{
						"Text": "MenuTestCustom"
					},
					"Translation":
					{
						"Text": "自定义的菜单"
					},
					"Key": "MenuTestCustom"
				},
				{
					"Source":
					{
						"Text": "MenuTestCustomTips"
					},
					"Translation":
					{
						"Text": "测试菜单提示"
					},
					"Key": "MenuTestCustomTips"
				},
				{
					"Source":
					{
						"Text": "MenuTestTips"
					},
					"Translation":
					{
						"Text": "测试菜单提示"
					},
					"Key": "MenuTestTips"
				},
				{
					"Source":
					{
						"Text": "MixPath1"
					},
					"Translation":
					{
						"Text": "混合命令1"
					},
					"Key": "MixPath1"
				},
				{
					"Source":
					{
						"Text": "MixPath1Tips"
					},
					"Translation":
					{
						"Text": "混合命令1提示"
					},
					"Key": "MixPath1Tips"
				},
				{
					"Source":
					{
						"Text": "MixPath2"
					},
					"Translation":
					{
						"Text": "混合2"
					},
					"Key": "MixPath2"
				},
				{
					"Source":
					{
						"Text": "MixPath2Tips"
					},
					"Translation":
					{
						"Text": "混合命令2提示"
					},
					"Key": "MixPath2Tips"
				},
				{
					"Source":
					{
						"Text": "MixSection1"
					},
					"Translation":
					{
						"Text": "混合节1"
					},
					"Key": "MixSection1"
				},
				{
					"Source":
					{
						"Text": "MixWidget"
					},
					"Translation":
					{
						"Text": "混合控件"
					},
					"Key": "MixWidget"
				},
				{
					"Source":
					{
						"Text": "Open the ClassBrowser"
					},
					"Translation":
					{
						"Text": "打开类浏览器"
					},
					"Key": "ClassBrowserTip"
				},
				{
					"Source":
					{
						"Text": "Path1"
					},
					"Translation":
					{
						"Text": "命令1"
					},
					"Key": "Path1"
				},
				{
					"Source":
					{
						"Text": "Path1Tips"
					},
					"Translation":
					{
						"Text": "命令1提示"
					},
					"Key": "Path1Tips"
				},
				{
					"Source":
					{
						"Text": "Path2"
					},
					"Translation":
					{
						"Text": "命令2"
					},
					"Key": "Path2"
				},
				{
					"Source":
					{
						"Text": "Path2Tips"
					},
					"Translation":
					{
						"Text": "命令2提示"
					},
					"Key": "Path2Tips"
				},
				{
					"Source":
					{
						"Text": "Path3"
					},
					"Translation":
					{
						"Text": "命令3"
					},
					"Key": "Path3"
				},
				{
					"Source":
					{
						"Text": "Path3Tips"
					},
					"Translation":
					{
						"Text": "命令3提示"
					},
					"Key": "Path3Tips"
				},
				{
					"Source":
					{
						"Text": "Path4"
					},
					"Translation":
					{
						"Text": "命令4"
					},
					"Key": "Path4"
				},
				{
					"Source":
					{
						"Text": "Path4Tips"
					},
					"Translation":
					{
						"Text": "命令4提示"
					},
					"Key": "Path4Tips"
				},
				{
					"Source":
					{
						"Text": "Path5"
					},
					"Translation":
					{
						"Text": "命令5"
					},
					"Key": "Path5"
				},
				{
					"Source":
					{
						"Text": "Path5Tips"
					},
					"Translation":
					{
						"Text": "命令5提示"
					},
					"Key": "Path5Tips"
				},
				{
					"Source":
					{
						"Text": "Path6"
					},
					"Translation":
					{
						"Text": "命令6"
					},
					"Key": "Path6"
				},
				{
					"Source":
					{
						"Text": "Path6Tips"
					},
					"Translation":
					{
						"Text": "命令6提示"
					},
					"Key": "Path6Tips"
				},
				{
					"Source":
					{
						"Text": "Path7"
					},
					"Translation":
					{
						"Text": "命令7"
					},
					"Key": "Path7"
				},
				{
					"Source":
					{
						"Text": "Path7Tips"
					},
					"Translation":
					{
						"Text": "命令7提示"
					},
					"Key": "Path7Tips"
				},
				{
					"Source":
					{
						"Text": "Path8"
					},
					"Translation":
					{
						"Text": "路径8"
					},
					"Key": "Path8"
				},
				{
					"Source":
					{
						"Text": "Path8Tips"
					},
					"Translation":
					{
						"Text": "路径8提示"
					},
					"Key": "Path8Tips"
				},
				{
					"Source":
					{
						"Text": "Section1"
					},
					"Translation":
					{
						"Text": "节1"
					},
					"Key": "Section1"
				},
				{
					"Source":
					{
						"Text": "Section1Tips"
					},
					"Translation":
					{
						"Text": "节1提示"
					},
					"Key": "Section1Tips"
				},
				{
					"Source":
					{
						"Text": "ShouldFail"
					},
					"Translation":
					{
						"Text": "应该失败"
					},
					"Key": "ShouldFail"
				},
				{
					"Source":
					{
						"Text": "ShouldFailTips"
					},
					"Translation":
					{
						"Text": "应该失败提示"
					},
					"Key": "ShouldFailTips"
				},
				{
					"Source":
					{
						"Text": "SubMenu1"
					},
					"Translation":
					{
						"Text": "子菜单1"
					},
					"Key": "SubMenu1"
				},
				{
					"Source":
					{
						"Text": "SubMenu1Tips"
					},
					"Translation":
					{
						"Text": "子菜单1提示"
					},
					"Key": "SubMenu1Tips"
				},
				{
					"Source":
					{
						"Text": "Useful tools for editor"
					},
					"Translation":
					{
						"Text": "有用的工具"
					},
					"Key": "EditorPlusToolsTips"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "EditorPlusTools",
					"Children": [
						{
							"Source":
							{
								"Text": "Command6"
							},
							"Translation":
							{
								"Text": "命令6"
							},
							"Key": "Command6"
						},
						{
							"Source":
							{
								"Text": "Command6 Tips"
							},
							"Translation":
							{
								"Text": "命令6提示"
							},
							"Key": "Command6_ToolTip"
						}
					]
				}
			]
		}
	]
}